package POSTECH_2022_Programming_Contest_Open;

/*
포닉스는 친구들과 POSTECH 캠퍼스 근처의
어느 가게에서 만나기로 약속을 했지만 정확한 가게 이름이 기억이 나지 않는다.
그나마 다행인 점은 가게 이름의 길이가 L이고
알파벳 대문자만으로 구성되었다는 점을 확실하게 기억하고 있고,
희미한 기억을 따라 가게 이름과 비슷한 것 같은 
몇 개의 가게 이름 후보를 적어 봤다.
포닉스는 정확한 가게 이름을 알 수 없으므로 
현재 기억나는 가게 이름의 후보들과 최대한 이름이 비슷한 가게를 찾을 것이다.
 N개의 가게 이름 후보가 주어질 때, 
이 N개의 이름 각각과 많아야 한 글자만 다르고 
길이가 L인 가게 이름을 찾아 보자.
*/

/*
입력: 
첫째 줄에 가게 이름 후보의 수 N과 가게 이름의 길이 L이 주어진다. (1 <= N, L <= 20)
이후 N줄에 걸쳐 가게 이름의 후보가 각 줄에 하나씩 주어진다. 
가게 이름의 후보는 길이가 L이고 모두 서로 다르며 알파벳 대문자로만 구성됨이 보장된다.
*/

/*
출력:
조건을 만족하는 가게 이름을 알파벳 대문자로 출력하여라. 
여러 가지가 가능하다면 그 중 하나만 출력하면 되며, 
조건을 만족하는 가게 이름이 존재하지 않는다면 CALL FRIEND를 출력하여라.
 */

public class A번_약속장소 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
