package POSTECH_2022_Programming_Contest_Open;

/*
포스텍에서는 기숙사 퇴사날이면 학생들이 집으로 보내는 택배 상자가 가득 쌓인다. 택배를 놓는 곳은 $N$행 $M$열으로 이루어진 격자로 표현된다. 격자의 각 칸은 크기 1의 정사각형 모양이며, 모든 택배 상자는 부피 1의 정육면체 형태이다. 온통 칙칙한 색인 택배 상자들을 보고 따분함을 느낀 포닉스는 택배 상자들을 옮기지 않고 보이는 모든 면에 붉은색 페인트를 칠하려 한다. 이 때, 보이는 면이란 다른 상자 또는 바닥과 닿아있지 않은 면을 말한다. 포닉스가 페인트칠을 마친 후, 어떤 면에도 페인트가 칠해져 있지 않은 택배 상자의 수를 구해 보자.
 */

/*
입력:
첫째 줄에 격자의 행의 수 $N$, 열의 수 $M$이 주어진다. $(1 \leq N, M \leq 1\,000)$ 

이후 둘째 줄부터 $N$줄에 걸쳐 각 줄에 $M$개의 수가 주어진다. $i$번째 줄의 $j$번째 수는 $i$번째 행 $j$번째 열에 해당하는 칸에 쌓인 택배 상자의 수 $A_{ij}$이다. $(0 \leq A_{ij} \leq 10^9)$ 
 */

/*
페인트칠을 마친 후, 어떤 면에도 페인트가 칠해져 있지 않은 택배 상자의 수를 출력한다.-
 */

public class G번_택배색칠 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
