package POSTECH_2022_Programming_Contest_Open;

/*
모두가 알다시피, 포닉스는 포스텍의 대표적인 멋쟁이이다! 포닉스는 멋쟁이답게 흰색 또는 검은색의 마스크, 티셔츠, 바지만을 입는다. 포닉스는 매일 다음과 같은 규칙으로 착장을 고른다.

마스크와 티셔츠는 다른 색이어야 한다.
티셔츠와 바지 역시 다른 색이어야 한다.
이틀 연속으로 같은 색의 티셔츠를 입지 않는다.
한번 착용한 마스크, 티셔츠, 바지는 다시 사용하지 않는다.
포닉스는 옷을 열심히 모으느라 새로운 옷을 살 돈이 없다. 포닉스가 가진 각 색의 마스크, 티셔츠, 바지의 개수가 주어질 때, 포닉스를 위해 새로운 옷을 사지 않고 연속해서 옷을 고를 수 있는 가장 긴 일수를 구해 보자.
 */

/*
입력:
첫째 줄에 포닉스가 가진 흰색 마스크와 검은색 마스크의 개수 $M_W, M_B$가 공백으로 구분되어 주어진다. $(0 \leq M_W, M_B \leq 10^9)$ 

둘째 줄에 포닉스가 가진 흰색 티셔츠와 검은색 티셔츠의 개수 $T_W, T_B$가 공백으로 구분되어 주어진다. $(0 \leq T_W, T_B \leq 10^9)$ 

셋째 줄에 포닉스가 가진 흰색 바지와 검은색 바지의 개수 $P_W, P_B$가 공백으로 구분되어 주어진다. $(0 \leq P_W, P_B \leq 10^9)$ 
 */

/*
출력:
포닉스가 연속해서 옷을 고를 수 있는 가장 긴 일수를 출력한다.
 */

public class H번_멋쟁이포닉스 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
