package POSTECH_2022_Programming_Contest_Open;

/*
포커는 트럼프 카드를 이용하여 하는 게임이다. 트럼프 카드는 4종류의 무늬와 13종류의 숫자를 조합하여 총 52장의 카드로 구성되어 있다.
트럼프 카드의 무늬는 스페이드, 하트, 다이아몬드, 클럽으로 총 4종류이고, 숫자는 A(에이스)와 2$\sim$10, 그리고 J(잭), Q(퀸), K(킹)으로 총 13종류이다.
52장의 카드 중 서로 다른 $N$장의 카드가 주어진다. 이 카드를 이용하여 족보를 만들어 최대한 많은 점수를 얻어야 한다. 족보의 종류와 얻을 수 있는 점수는 아래와 같다.

페어(2점): 무늬와 관계없이 같은 숫자 2장  
트리플(5점): 무늬와 관계없이 같은 숫자 3장
포카드(10점): 무늬와 관계없이 같은 숫자 4장
플러시(10점): 숫자와 관계없이 같은 무늬 5장
 $N$장의 카드를 사용하여 만들 수 있는 족보 점수 합의 최댓값을 출력해라. 모든 카드를 사용하지 않아도 되지만, 각 카드는 하나의 족보에만 사용할 수 있다.
 */

/*
입력:
첫째 줄에는 가지고 있는 카드의 수 $N$이 주어진다. $(1 \leq N \leq 52)$ 

둘째 줄부터 $N$개의 줄에 걸쳐 가지고 있는 카드의 무늬와 숫자가 주어진다. 무늬는 Spade, Heart, Diamond, Club 중 하나이고, 숫자는 A, 2 이상 10 이하의 자연수, J, Q, K중 하나이다. 주어지는 $N$장의 카드는 서로 다름이 보장된다.
 */

/*
 $N$장의 카드를 사용해 만들 수 있는 족보 점수 합의 최댓값을 출력해라.
 */

public class L번_포커 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
